var relations = [{"node_id":1001,"node_name":"島村卯月","relation_ids":{"2001":32,"3001":31,"9999":2,"1025":5,"1011":1,"1047":1,"1032":1,"1012":5}},{"node_id":1002,"node_name":"中野有香","relation_ids":{"3039":5,"2051":1,"3045":1,"1005":7,"1058":1,"1003":7,"3020":2}},{"node_id":1003,"node_name":"水本ゆかり","relation_ids":{"1002":8,"1005":8,"2014":2,"1035":1,"2011":1,"2041":1,"3022":1,"9999":1}},{"node_id":1004,"node_name":"福山舞","relation_ids":{"1018":18,"3004":3,"1022":1,"3039":1,"1024":8,"2046":8,"3019":9,"2014":1,"1007":1}},{"node_id":1005,"node_name":"椎名法子","relation_ids":{"3901":6,"1002":8,"1003":7,"1008":4,"3054":6,"1010":1,"2051":1,"3045":1,"2057":3,"1038":1,"2002":1}},{"node_id":1006,"node_name":"今井加奈","relation_ids":{"2018":1,"1044":3,"1027":3,"3050":1,"1055":1,"2046":1,"1028":4,"1051":9,"1008":1,"1017":2,"3009":4}},{"node_id":1007,"node_name":"持田亜里沙","relation_ids":{"1004":2,"2014":2,"3024":7,"1045":1,"2005":1,"3042":1,"3018":1,"2003":1}},{"node_id":1008,"node_name":"三村かな子","relation_ids":{"1006":2,"1007":1,"3035":1,"3901":3,"1012":2,"1032":2,"2030":2}},{"node_id":1009,"node_name":"奥山沙織","relation_ids":{"1045":4,"3008":4,"2035":3,"2023":4,"2038":5,"2025":12,"1038":4,"3044":2,"3023":1,"3014":1,"2054":1,"3021":1,"2049":1,"2042":3,"3024":3,"1031":2,"1013":2,"2006":2,"2022":1,"3036":3,"3026":2,"3017":2,"3019":3,"1005":1,"1008":1,"3018":2,"1020":1,"2015":1,"1041":1,"1030":1}},{"node_id":1010,"node_name":"間中美里","relation_ids":{"3029":1,"3003":9,"2031":3}},{"node_id":1011,"node_name":"小日向美穂","relation_ids":{"2030":7,"3010":6,"2019":7,"3033":6,"9999":2,"3035":1,"1001":3,"2029":2,"2056":1,"1030":1,"1047":5,"2007":4,"1043":3}},{"node_id":1012,"node_name":"緒方智絵里","relation_ids":{"1007":1,"2012":1,"3031":1,"1047":3,"2029":2,"3029":1,"2002":1,"2007":1,"1032":1,"9999":1,"3034":3,"2008":3,"1001":5,"2019":1}},{"node_id":1013,"node_name":"五十嵐響子","relation_ids":{"1061":1,"3013":6,"3006":4,"2037":3,"2027":3,"2039":5,"1011":1,"1021":1,"3016":3,"1008":2,"3044":2,"1009":2,"2023":2,"2042":4,"1034":3,"1014":3,"1024":1,"1059":1}},{"node_id":1014,"node_name":"柳瀬美由紀","relation_ids":{"3043":1,"2010":1,"2049":4,"3017":3}},{"node_id":1015,"node_name":"櫻井桃華","relation_ids":{"3015":3,"3021":3,"3034":1,"2014":1}},{"node_id":1016,"node_name":"江上椿","relation_ids":{"3002":1,"3032":1,"3019":1}},{"node_id":1017,"node_name":"長富蓮実","relation_ids":{"2026":1,"1006":1,"2002":4,"2004":4}},{"node_id":1018,"node_name":"横山千佳","relation_ids":{"2014":3,"3010":1,"3004":3,"1004":3}},{"node_id":1019,"node_name":"関裕美","relation_ids":{"2017":2,"3015":3,"2057":1,"1020":1,"3031":11,"2010":7,"1032":3,"9999":1,"3009":1}},{"node_id":1020,"node_name":"太田優","relation_ids":{"1046":5,"2025":6,"3037":1,"2057":1,"2053":3}},{"node_id":1021,"node_name":"棟方愛海","relation_ids":{"3017":7,"1039":2,"2014":1,"2017":1,"3009":3,"1042":1}},{"node_id":1022,"node_name":"藤本里奈","relation_ids":{"3038":5,"3039":3,"3032":4,"3013":8,"1057":1,"2006":1,"3030":4}},{"node_id":1023,"node_name":"大原みちる","relation_ids":{"3016":5,"2031":3,"2040":3,"3048":4}},{"node_id":1024,"node_name":"遊佐こずえ","relation_ids":{"2004":8,"1004":7}},{"node_id":1025,"node_name":"前川みく","relation_ids":{"1001":6,"2001":6,"3001":6,"2055":6,"2030":1,"2012":4,"3035":3,"3031":1,"1012":2,"2019":1,"1047":5}},{"node_id":1026,"node_name":"赤西瑛梨華","relation_ids":{"3047":5}},{"node_id":1027,"node_name":"松原早耶","relation_ids":{"3019":1,"1006":4,"1044":3}},{"node_id":1028,"node_name":"相原雪乃","relation_ids":{"3004":1,"2047":1,"1051":9,"1006":4}},{"node_id":1029,"node_name":"宮本フレデリカ","relation_ids":{"2006":1,"1059":6}},{"node_id":1030,"node_name":"小早川紗枝","relation_ids":{"2048":6,"3023":1,"2033":1,"2037":4,"3021":1,"1052":5,"3042":7,"2007":6,"1055":1}},{"node_id":1031,"node_name":"西園寺琴歌","relation_ids":{"3026":5,"2021":9,"3014":9,"3015":2,"3042":1,"1025":1,"3009":1,"2031":1}},{"node_id":1032,"node_name":"双葉杏","relation_ids":{"3034":23,"1008":1,"1012":1,"1019":5,"3031":5,"2010":2,"3009":2}},{"node_id":1033,"node_name":"楊菲菲","relation_ids":{"3009":1}},{"node_id":1034,"node_name":"桃井あずき","relation_ids":{"2049":2,"3048":2,"2011":11,"1048":2,"2036":2,"3015":16,"1035":3,"3019":4,"3022":7,"2018":9,"3004":3,"2029":6,"3013":5,"1033":3}},{"node_id":1035,"node_name":"涼宮星花","relation_ids":{"3044":1,"1015":1,"1028":1,"2034":3,"3032":1,"2024":12,"3053":5,"1049":1,"2056":1,"2012":4,"1003":1,"9999":1}},{"node_id":1036,"node_name":"月宮雅","relation_ids":{"2037":1,"3020":2,"2002":1,"1002":1,"2043":2}},{"node_id":1037,"node_name":"兵藤レナ","relation_ids":{"2016":3,"3054":3,"2037":1,"1048":5,"2020":1,"3028":1,"3046":1,"2006":3,"3027":2,"2056":1,"2029":1}},{"node_id":1038,"node_name":"道明寺歌鈴","relation_ids":{"2009":9,"3002":9,"3035":2,"2007":1,"2032":1,"3036":3}},{"node_id":1039,"node_name":"柳清良","relation_ids":{"1021":1,"2014":1,"3020":5,"2026":5}},{"node_id":1040,"node_name":"井村雪菜","relation_ids":{"2047":5,"3041":3,"2050":1}},{"node_id":1041,"node_name":"日下部若葉","relation_ids":{"2005":1,"3010":1,"3029":1,"3041":1,"3034":1,"1003":5}},{"node_id":1042,"node_name":"榊原里美","relation_ids":{"2025":3,"3027":1,"2041":3,"3008":4,"2059":1}},{"node_id":1043,"node_name":"輿水幸子","relation_ids":{"2007":10,"3012":2,"9999":1,"1011":3,"3040":4,"2029":3}},{"node_id":1044,"node_name":"安斎都","relation_ids":{"1006":4,"1027":3,"2060":1,"3058":3,"2061":3}},{"node_id":1045,"node_name":"浅野風香","relation_ids":{"3016":1,"2005":5,"1009":1,"2063":5}},{"node_id":1046,"node_name":"大西由里子","relation_ids":{"1026":1,"1020":5,"3020":5}},{"node_id":1047,"node_name":"安部菜々","relation_ids":{"1062":1,"3002":3,"2033":3,"3026":5,"2048":5,"3010":5,"2019":3,"1011":5,"1025":5}},{"node_id":1048,"node_name":"工藤忍","relation_ids":{"1037":5,"2036":12,"3015":4,"1034":4,"2040":2,"3045":2}},{"node_id":1049,"node_name":"栗原ネネ","relation_ids":{}},{"node_id":1050,"node_name":"古賀小春","relation_ids":{"2007":1,"3019":8,"2014":4,"3004":3,"2056":4,"3046":4}},{"node_id":1051,"node_name":"クラリス","relation_ids":{"3008":1,"2049":1,"2035":1,"3038":1,"2042":1,"1028":3,"1006":4}},{"node_id":1052,"node_name":"佐久間まゆ","relation_ids":{"1030":10}},{"node_id":1053,"node_name":"村松さくら","relation_ids":{"2052":48,"3901":6,"3051":9}},{"node_id":1054,"node_name":"丹羽仁美","relation_ids":{"3049":5,"1033":5,"3016":1,"2038":3,"2054":2,"1030":1,"3056":8,"2049":1}},{"node_id":1055,"node_name":"白菊ほたる","relation_ids":{"1006":1,"2046":6,"3050":4,"3034":22,"2053":8,"3055":9,"1030":6,"2007":5,"3042":6}},{"node_id":1056,"node_name":"早坂美玲","relation_ids":{"2054":9,"3021":6,"3046":4,"3058":1,"2024":3,"1024":1}},{"node_id":1057,"node_name":"有浦柑奈","relation_ids":{"2024":3,"3025":3,"3042":1,"2058":1,"3052":1,"2047":4,"3004":4,"2032":1,"9999":1}},{"node_id":1058,"node_name":"大沼くるみ","relation_ids":{"2047":2,"3018":2,"3049":1,"1002":1}},{"node_id":1059,"node_name":"一ノ瀬志希","relation_ids":{"1029":6}},{"node_id":1060,"node_name":"乙倉悠貴","relation_ids":{"3056":10,"2057":3,"3043":4,"2050":5,"3052":5,"2062":1}},{"node_id":1061,"node_name":"原田美世","relation_ids":{"1013":2,"1020":1,"2015":1,"3036":15,"3005":2,"3039":6,"3013":5,"3033":1,"9999":1}},{"node_id":1062,"node_name":"池袋晶葉","relation_ids":{"1031":4,"2053":1,"2024":3,"2060":2}},{"node_id":1996,"node_name":"天海春香","relation_ids":{"2996":9,"3999":1}},{"node_id":1997,"node_name":"菊地真","relation_ids":{}},{"node_id":1998,"node_name":"高槻やよい","relation_ids":{"1997":1,"3995":6}},{"node_id":1999,"node_name":"我那覇響","relation_ids":{"2998":1,"3999":1}},{"node_id":2001,"node_name":"渋谷凛","relation_ids":{"2033":8,"1001":31,"3001":35,"2029":3,"3030":5,"9999":2,"2019":5,"3033":6,"3035":1,"1011":4,"2008":6,"2007":1}},{"node_id":2002,"node_name":"黒川千秋","relation_ids":{"3020":1,"1036":1,"2037":6,"1010":1,"3007":5,"2004":4,"1017":2,"2020":2}},{"node_id":2003,"node_name":"松本沙理奈","relation_ids":{"2010":1,"2009":3,"2014":5,"2013":6,"2004":1,"1045":1,"3044":1,"3024":1,"1007":1,"3018":1}},{"node_id":2004,"node_name":"桐野アヤ","relation_ids":{"2027":6,"1001":1,"3038":2,"2002":4,"1017":2,"1024":1}},{"node_id":2005,"node_name":"高橋礼子","relation_ids":{"2017":5,"1007":1,"3024":1,"3007":1,"3053":1,"1029":1,"2032":8,"3022":3,"2006":5}},{"node_id":2006,"node_name":"相川千夏","relation_ids":{"3013":5,"2005":5,"3018":8}},{"node_id":2007,"node_name":"川島瑞樹","relation_ids":{"2029":1,"1011":4,"1043":9,"3029":1,"2010":5,"3050":6,"2019":1,"2055":1,"3033":5,"3022":1,"1030":4,"3042":1,"1055":1,"2037":1}},{"node_id":2008,"node_name":"神谷奈緒","relation_ids":{"2033":15,"2001":14,"3021":1,"1012":2,"3034":3,"9999":1,"1020":3,"2015":3,"2010":3}},{"node_id":2009,"node_name":"上条春菜","relation_ids":{"3034":2,"2003":4,"2014":5,"1038":7,"3002":6,"2033":2,"3035":2,"2024":18,"1022":1,"3036":6,"2010":3,"1025":1,"2039":1,"2023":2}},{"node_id":2010,"node_name":"荒木比奈","relation_ids":{"1020":5,"2015":5,"2008":5,"2009":1,"3007":1,"2059":1,"2007":5,"3031":17,"1019":16,"1032":15,"3030":3,"3009":8,"9999":1,"3043":1,"1014":1}},{"node_id":2011,"node_name":"東郷あい","relation_ids":{"1031":1,"2042":2,"3004":1,"3022":2,"2039":1}},{"node_id":2012,"node_name":"多田李衣菜","relation_ids":{"3005":51,"3035":3,"1025":6,"3001":1,"3901":3}},{"node_id":2013,"node_name":"水木聖來","relation_ids":{"2061":2,"2001":1,"1018":1,"2025":12,"2028":3}},{"node_id":2014,"node_name":"佐々木千枝","relation_ids":{"1014":2,"3004":4,"2003":4,"2009":3,"1050":4,"3017":1,"1021":1,"1039":1,"1018":2,"1004":1,"1020":1,"1015":4,"3034":2}},{"node_id":2015,"node_name":"三船美優","relation_ids":{"2005":3,"3031":1,"2006":1,"2010":4,"3021":1,"1020":8,"2008":4,"9999":1,"2039":2,"3040":1,"2032":1,"3058":5,"3018":3}},{"node_id":2016,"node_name":"服部瞳子","relation_ids":{"2056":1,"1037":4,"3054":3}},{"node_id":2017,"node_name":"木場真奈美","relation_ids":{"3901":3,"3058":9,"3025":5,"1021":4,"1010":1,"3054":1,"1005":1,"1019":1,"3015":1,"2038":4,"2005":5}},{"node_id":2018,"node_name":"藤原肇","relation_ids":{"2011":1,"1034":1,"1039":1,"3052":1,"3017":1}},{"node_id":2019,"node_name":"新田美波","relation_ids":{"2029":6,"3014":4,"1011":4,"3033":5,"1043":5,"1008":1,"2022":1,"3035":1,"2001":2,"3030":2,"1001":1,"3001":1,"1049":1,"3046":1,"3031":1,"2055":1,"1032":1,"2051":5,"2030":1}},{"node_id":2020,"node_name":"水野翠","relation_ids":{"2002":4,"1037":6,"3046":1}},{"node_id":2021,"node_name":"橘ありす","relation_ids":{"1031":8,"3014":9,"3015":1,"3050":8,"2057":4}},{"node_id":2022,"node_name":"鷺沢文香","relation_ids":{"2041":1}},{"node_id":2023,"node_name":"八神マキノ","relation_ids":{"1024":1,"1009":10,"3044":10,"2054":1,"3021":1,"1013":4,"2042":2,"3052":2,"2017":1,"2009":1,"1003":2,"1035":2,"1022":3,"3039":3,"1059":3,"3051":2,"1051":3,"1057":1,"2010":1,"1032":1,"2022":1,"2060":1,"2024":3,"3019":1,"3032":1,"9999":1}},{"node_id":2024,"node_name":"ライラ","relation_ids":{"3053":4,"1035":2,"2009":5,"1062":1,"2053":2,"2056":1,"3036":25,"2012":3}},{"node_id":2025,"node_name":"ヘレン","relation_ids":{"3031":1,"1018":1,"2039":1,"3055":5,"1042":1,"2012":2,"3037":1,"2013":3,"2028":3,"3036":5}},{"node_id":2026,"node_name":"松永涼","relation_ids":{"2042":4,"1039":6}},{"node_id":2027,"node_name":"小室千奈美","relation_ids":{"2004":6,"3028":1}},{"node_id":2028,"node_name":"高峯のあ","relation_ids":{"2025":12,"2013":3}},{"node_id":2029,"node_name":"高垣楓","relation_ids":{"3009":1,"1037":1,"2032":1,"1034":4,"3013":4,"1043":3,"3040":4}},{"node_id":2030,"node_name":"神崎蘭子","relation_ids":{"2001":6,"1001":3,"3001":3,"1025":3,"2029":3,"2007":1,"2058":5,"2051":1,"1008":3}},{"node_id":2031,"node_name":"伊集院惠","relation_ids":{"1023":2,"3009":1,"1031":1,"3003":4,"1010":3}},{"node_id":2032,"node_name":"柊志乃","relation_ids":{"2029":2,"2005":9,"2009":1,"3036":3,"3044":1,"3022":3}},{"node_id":2033,"node_name":"北条加蓮","relation_ids":{"2001":11,"2008":12,"2009":3,"1047":4,"3002":3}},{"node_id":2034,"node_name":"ケイト","relation_ids":{"1035":1,"3032":2,"1059":2,"3997":1,"3006":1,"2018":1,"3017":1,"1006":1,"1024":1,"3048":1}},{"node_id":2035,"node_name":"瀬名詩織","relation_ids":{"3044":5,"2049":1,"1051":3,"2030":1,"1013":5,"1009":3,"3008":4}},{"node_id":2036,"node_name":"綾瀬穂乃香","relation_ids":{"3015":6,"1048":10,"1034":1,"1054":1,"3049":1}},{"node_id":2037,"node_name":"佐城雪美","relation_ids":{"1013":4,"3013":3,"3020":2,"2002":6,"3044":1,"1037":1,"9999":1,"2048":3,"1030":3}},{"node_id":2038,"node_name":"篠原礼","relation_ids":{"1054":1,"3016":1,"2054":1}},{"node_id":2039,"node_name":"和久井留美","relation_ids":{"1004":1,"1022":2,"3039":1,"2011":1,"1013":5}},{"node_id":2040,"node_name":"吉岡沙紀","relation_ids":{"1024":3,"3024":2,"3045":7,"3048":4,"1023":3}},{"node_id":2041,"node_name":"梅木音葉","relation_ids":{"3008":4,"1042":3}},{"node_id":2042,"node_name":"白坂小梅","relation_ids":{"2030":2,"9999":1,"3010":4,"3031":8,"2026":3,"2055":17,"1029":1,"2011":1,"3044":4,"1009":5,"1013":5,"2023":5,"1032":1}},{"node_id":2043,"node_name":"岸部彩華","relation_ids":{"1052":1,"3046":1,"3020":2,"1036":1}},{"node_id":2044,"node_name":"氏家むつみ","relation_ids":{"3043":1,"1014":1,"2010":1,"3023":5,"1027":1}},{"node_id":2045,"node_name":"西川保奈美","relation_ids":{}},{"node_id":2046,"node_name":"成宮由愛","relation_ids":{"3018":1,"1006":1,"1055":4,"3050":4,"3019":6,"1018":9,"1004":5}},{"node_id":2047,"node_name":"藤居朋","relation_ids":{"1028":1,"3004":4,"1057":4,"3041":3,"1040":4,"3018":1}},{"node_id":2048,"node_name":"塩見周子","relation_ids":{"1030":9,"2037":4,"3026":2,"3010":1,"1047":1,"2019":1,"3901":3}},{"node_id":2049,"node_name":"脇山珠美","relation_ids":{"1014":3,"3017":3,"3014":1,"3051":1,"1027":1,"3046":1,"3008":2,"3013":12,"1020":1,"1061":7,"2015":1,"1013":2,"1029":1,"3049":2}},{"node_id":2050,"node_name":"岡崎泰葉","relation_ids":{"1029":3,"3053":3,"1040":1,"2054":1,"3052":9,"1060":9,"2062":6,"1018":1}},{"node_id":2051,"node_name":"速水奏","relation_ids":{"1005":5,"3045":4,"3058":2,"2033":2,"2019":5}},{"node_id":2052,"node_name":"大石泉","relation_ids":{"1053":47,"3051":43}},{"node_id":2053,"node_name":"松尾千鶴","relation_ids":{"3055":10,"1055":8,"3034":24,"2024":3}},{"node_id":2054,"node_name":"森久保乃々","relation_ids":{"1021":7,"3056":6,"3053":7,"2050":7,"1029":7,"3026":2,"1056":10,"3021":6,"2063":5,"3016":1,"2038":1,"1015":5,"3046":3,"3058":1,"1060":1,"3039":6}},{"node_id":2055,"node_name":"アナスタシア","relation_ids":{"1025":5,"1006":1,"2042":9,"1018":1,"2039":1}},{"node_id":2056,"node_name":"大和亜季","relation_ids":{"3028":5,"1045":1,"3016":4,"2054":1,"1050":3,"3046":5,"1037":2}},{"node_id":2057,"node_name":"結城晴","relation_ids":{"2028":1,"1049":11,"3025":16,"2058":10,"1030":17,"1002":6,"3020":4,"3043":4,"1060":3,"3054":5,"1005":3,"3014":5,"3050":3,"2021":5}},{"node_id":2058,"node_name":"二宮飛鳥","relation_ids":{"1049":7,"3025":10,"3023":2}},{"node_id":2059,"node_name":"浅利七海","relation_ids":{"3022":1,"1021":1,"1042":1}},{"node_id":2060,"node_name":"古澤頼子","relation_ids":{"1062":3,"3026":1,"2045":5}},{"node_id":2061,"node_name":"望月聖","relation_ids":{"1051":3,"3058":3,"1044":4}},{"node_id":2062,"node_name":"鷹富士茄子","relation_ids":{}},{"node_id":2063,"node_name":"桐生つかさ","relation_ids":{"1045":5}},{"node_id":2996,"node_name":"如月千早","relation_ids":{"1996":4}},{"node_id":2997,"node_name":"三浦あずさ","relation_ids":{"2996":1,"2998":1}},{"node_id":2998,"node_name":"四条貴音","relation_ids":{}},{"node_id":2999,"node_name":"秋月律子","relation_ids":{"3999":1,"2997":1}},{"node_id":3001,"node_name":"本田未央","relation_ids":{"1001":43,"2001":40,"9999":5,"1025":6,"2029":2,"3030":1,"1020":1,"3033":1,"3034":1,"3002":7}},{"node_id":3002,"node_name":"高森藍子","relation_ids":{"3001":8,"3017":1,"3026":1,"1047":4,"2033":3,"3035":5,"2009":5,"1038":5,"3033":3}},{"node_id":3003,"node_name":"並木芽衣子","relation_ids":{"3901":3,"2026":1,"3045":2,"1035":1,"1010":8,"3034":1,"2031":3}},{"node_id":3004,"node_name":"龍崎薫","relation_ids":{"3022":1,"1062":9,"1031":7,"1057":4,"2047":3,"2014":5,"1050":5,"1018":4,"1004":3}},{"node_id":3005,"node_name":"木村夏樹","relation_ids":{"2012":98,"3039":6,"1061":3}},{"node_id":3006,"node_name":"松山久美子","relation_ids":{"1013":1,"2027":1,"3028":1}},{"node_id":3007,"node_name":"斉藤洋子","relation_ids":{"1014":1,"2026":1,"2005":1,"3053":1,"1029":1}},{"node_id":3008,"node_name":"沢田麻理菜","relation_ids":{"2041":3,"1042":3,"1009":3,"2035":4,"1006":4,"3043":1,"2027":2,"2049":1,"1051":3}},{"node_id":3009,"node_name":"矢口美羽","relation_ids":{"3006":1,"1006":11,"1033":1,"2017":1,"1021":1,"3001":5,"3016":3,"2029":3,"1019":7,"1032":9,"2010":7,"3031":7,"9999":3}},{"node_id":3010,"node_name":"赤城みりあ","relation_ids":{"1041":1,"1020":1,"2005":1,"2015":1,"3031":6,"2042":3,"3034":4,"2019":1}},{"node_id":3011,"node_name":"愛野渚","relation_ids":{}},{"node_id":3012,"node_name":"真鍋いつき","relation_ids":{"3008":1,"3006":1}},{"node_id":3013,"node_name":"大槻唯","relation_ids":{"3011":1,"2006":15,"3034":1,"1034":5,"2018":1,"1013":4,"2037":3,"3030":4,"1022":6,"3044":2,"1032":1,"1061":7,"1020":1,"2015":1,"2029":5,"3032":4,"1057":1}},{"node_id":3014,"node_name":"姫川友紀","relation_ids":{"3034":1,"3033":1,"1031":7,"2021":6,"3015":1,"2057":5}},{"node_id":3015,"node_name":"喜多見柚","relation_ids":{"1015":4,"3021":3,"3022":1,"1019":2,"2017":2,"3042":2,"3014":3,"1031":3,"2021":3,"1034":14,"1048":3}},{"node_id":3016,"node_name":"上田鈴帆","relation_ids":{"2016":1,"3040":1,"3048":10,"2054":1,"1054":1,"2038":1,"1023":5}},{"node_id":3017,"node_name":"海老原菜帆","relation_ids":{"1014":3,"2049":4,"1021":6,"1008":1}},{"node_id":3018,"node_name":"及川雫","relation_ids":{"2006":5,"3035":1,"2047":2,"1058":8,"2003":3,"3024":1,"1007":1,"3058":5,"1020":5,"2015":5}},{"node_id":3019,"node_name":"小関麗奈","relation_ids":{"3057":1,"1050":9,"1018":5,"2046":5,"3046":1,"3032":1}},{"node_id":3020,"node_name":"衛藤美紗希","relation_ids":{"1039":5,"2002":1,"2037":1,"1046":5}},{"node_id":3021,"node_name":"星輝子","relation_ids":{"3901":9,"1020":1,"2015":1,"1015":4,"3015":3,"2042":2,"1056":3,"2054":3,"3023":5}},{"node_id":3022,"node_name":"片桐早苗","relation_ids":{"3018":2,"1039":1,"3023":1,"1021":1,"3004":4,"2011":4,"1034":3,"2032":3,"2005":4}},{"node_id":3023,"node_name":"堀裕子","relation_ids":{"3901":3,"3021":6,"2044":15,"2058":4,"3025":4,"1049":3,"2057":5,"3053":2,"1029":1}},{"node_id":3024,"node_name":"西島櫂","relation_ids":{"1024":1,"1045":2,"3018":1,"1007":1}},{"node_id":3025,"node_name":"的場梨沙","relation_ids":{"1057":3,"2024":3,"2058":6,"1049":6,"9999":1,"2057":5,"2041":1}},{"node_id":3026,"node_name":"相葉夕美","relation_ids":{"2048":2,"1031":6,"2001":1,"1029":4,"2050":1,"3053":1,"1004":2,"2039":2,"1022":2,"3039":2}},{"node_id":3027,"node_name":"野々村そら","relation_ids":{"1042":1,"3018":1,"1037":3,"2006":3}},{"node_id":3028,"node_name":"浜川愛結奈","relation_ids":{"2056":5,"1037":1,"2020":1,"3046":6,"1009":1,"3032":1}},{"node_id":3029,"node_name":"若林智香","relation_ids":{"1041":1,"1052":1,"2043":1,"3046":1,"2002":1,"2007":1,"3034":1,"3007":2,"3012":2,"2040":1}},{"node_id":3030,"node_name":"城ヶ崎美嘉","relation_ids":{"3031":51,"1011":2,"1043":1,"3033":3,"2019":3,"2001":8,"3001":1,"1001":1,"9999":2,"3013":4,"1022":2}},{"node_id":3031,"node_name":"城ヶ崎莉嘉","relation_ids":{"3030":10,"2042":8,"3034":5,"3010":8,"2019":1,"3058":1,"1032":22,"1019":18,"2010":18,"3009":9,"9999":1}},{"node_id":3032,"node_name":"仙崎恵磨","relation_ids":{"2034":9,"1035":2,"3044":2,"1022":4,"3013":4,"1057":1,"2006":1,"3019":1,"2023":1}},{"node_id":3033,"node_name":"日野茜","relation_ids":{"3035":4,"2022":3,"1008":3,"9999":2,"1011":1,"1043":1,"3001":3,"3002":3}},{"node_id":3034,"node_name":"諸星きらり","relation_ids":{"1032":25,"3031":5,"3010":5,"2008":3,"1012":3}},{"node_id":3035,"node_name":"十時愛梨","relation_ids":{"2012":3,"1025":4,"1008":1,"3002":5}},{"node_id":3036,"node_name":"ナターリア","relation_ids":{"1006":8,"1059":3,"1040":1,"1018":1,"2039":2,"3042":1,"3024":2,"2035":1,"1022":3,"3008":3,"3040":2,"3901":10,"1047":2,"2017":1,"2009":2,"1038":1,"2024":25,"9999":2,"2047":1,"1061":6}},{"node_id":3037,"node_name":"相馬夏美","relation_ids":{"1020":1,"2025":3,"2057":1}},{"node_id":3038,"node_name":"槙原志保","relation_ids":{"1022":5,"2004":1,"3045":1,"3036":3,"1051":3,"1036":5}},{"node_id":3039,"node_name":"向井拓海","relation_ids":{"3050":5,"1002":1,"1005":2,"3015":2,"2050":2,"3053":3,"1029":3,"1022":6,"1004":1,"2039":4,"3005":3,"1061":5,"1037":2,"2038":1,"3041":2,"3022":1,"2054":5,"2062":4,"3051":2,"1054":3}},{"node_id":3040,"node_name":"市原仁奈","relation_ids":{"1043":3,"2029":3,"3025":5,"1032":1}},{"node_id":3041,"node_name":"杉坂海","relation_ids":{"2047":5,"1040":3,"1015":1,"1046":1,"2054":1}},{"node_id":3042,"node_name":"喜多日菜子","relation_ids":{"3901":3,"1057":1,"3052":1,"1021":5,"1030":8,"2007":9}},{"node_id":3043,"node_name":"北川真尋","relation_ids":{"2010":2,"1014":2,"2027":1,"3034":1,"2050":1,"2057":3,"1060":3}},{"node_id":3044,"node_name":"メアリー・コクラン","relation_ids":{"1006":1,"3032":1,"2021":7,"1050":2,"3031":19,"2023":32,"3047":4,"3901":15,"1009":15,"3048":3,"3001":1,"1018":2,"1013":2,"2042":21,"3058":3,"2024":10,"3036":10,"3002":3,"2007":2,"1002":1,"2047":2,"1019":1,"3013":1,"1022":1,"2003":1,"1017":2,"1037":2}},{"node_id":3045,"node_name":"小松伊吹","relation_ids":{"3003":1,"1035":1,"2021":5,"2004":1,"3038":1,"2051":3,"1005":3,"1002":2,"2040":7}},{"node_id":3046,"node_name":"三好紗南","relation_ids":{"2054":4,"3029":1,"2043":1,"1056":8,"3058":1,"1037":1,"2020":1,"1050":3,"2056":4,"2024":3,"1024":2}},{"node_id":3047,"node_name":"キャシー・グラハム","relation_ids":{"3031":7,"1026":7,"3030":13,"3058":1,"3032":1,"3009":1,"1016":1,"2046":1}},{"node_id":3048,"node_name":"難波笑美","relation_ids":{"3016":10,"2040":3,"1023":3}},{"node_id":3049,"node_name":"浜口あやめ","relation_ids":{"1054":1,"2036":1,"3019":1,"1058":1,"1002":1,"3052":1,"2049":2}},{"node_id":3050,"node_name":"村上巴","relation_ids":{"2046":6,"1006":1,"1055":4,"2021":12,"1021":1,"3009":1,"3026":5,"2007":5,"2057":4}},{"node_id":3051,"node_name":"土屋亜子","relation_ids":{"2052":18,"1053":44,"3048":8}},{"node_id":3052,"node_name":"首藤葵","relation_ids":{"3049":1,"1057":1,"3042":1,"1054":2,"1060":5,"2062":2,"2050":3}},{"node_id":3053,"node_name":"冴島清美","relation_ids":{"1035":3,"2024":12,"1029":12,"2050":12,"2032":1,"2012":5,"2005":1,"3007":1}},{"node_id":3054,"node_name":"財前時子","relation_ids":{"2017":1,"1010":1,"1037":4,"2016":3,"1005":4,"2057":3}},{"node_id":3055,"node_name":"佐藤心","relation_ids":{"1021":5,"1055":8,"2053":8,"3034":19,"2025":15}},{"node_id":3056,"node_name":"依田芳乃","relation_ids":{}},{"node_id":3057,"node_name":"南条光","relation_ids":{"1062":2,"1057":5}},{"node_id":3058,"node_name":"イヴ・サンタクロース","relation_ids":{"3024":3,"1044":4,"2061":3,"2039":1,"1051":25,"1020":5,"2015":5,"3018":3}},{"node_id":3901,"node_name":"トレーナー","relation_ids":{}},{"node_id":3902,"node_name":"ルーキートレーナー","relation_ids":{"3901":10}},{"node_id":3903,"node_name":"ベテラントレーナー","relation_ids":{"3901":10}},{"node_id":3904,"node_name":"マスタートレーナー","relation_ids":{}},{"node_id":3995,"node_name":"萩原雪歩","relation_ids":{"1997":8,"3997":1,"3998":1,"1998":5}},{"node_id":3996,"node_name":"水瀬伊織","relation_ids":{"2997":1,"1998":2}},{"node_id":3997,"node_name":"双海真美","relation_ids":{"3998":10}},{"node_id":3998,"node_name":"双海亜美","relation_ids":{"3997":4}},{"node_id":3999,"node_name":"星井美希","relation_ids":{"2996":1,"2008":1}},{"node_id":9999,"node_name":"千川ちひろ","relation_ids":{}}];
var force = null;
var svg = null;

function getNode(id) {
	for (var i=0; i < relations.length; i++) {
		if (relations[i].node_id == id) return relations[i];
	}
	return null;
}

function initForceLayout() {
	var width = 1024,
	    height = 960;

	var color = d3.scale.category20();

	force = d3.layout.force()
	    .charge(-200)
	    .linkDistance(200)
	    .size([width, height]);

	svg = d3.select("#chart").append("svg")
	    .attr("width", width)
	    .attr("height", height);
}

function createForceLayout(id, recursive) {
	var search_node = getNode(id);
	var rels = [];

	if (search_node && recursive) {
		rels = relations.filter(function(d) {
			return (d.node_id == search_node.node_id || d.relation_ids[search_node.node_id] || search_node.relation_ids[d.node_id]);
		});
		for (var i=1; i < recursive; i++) {
			rels.forEach(function(d) {
				for (key in d.relation_ids) { rels.push(getNode(key)); }
			})
		}
		rels = rels.filter(function(d, i, self) {
			for (var n=0; n < self.length; n++) {
				if (self[n].node_id == d.node_id) {
					if (i == n)
						return true;
					else break;
				}
			}
			return false;
		})
	} else {
		rels = relations;
	}

	graph = {
		"nodes": rels.map(function(d) { return {"id":d.node_id, "name": d.node_name, "group":d.node_id.toString().substring(0, 1)}; } ),
		"links": []
	};
	
	var getIndex = function(key) {
		for (var i=0; i < rels.length; i++) {
			if (rels[i].node_id == key) return i;
		}
		return -1;
	};
	for (var i=0; i < rels.length; i++) {
		for (key in rels[i].relation_ids) {
			var target = getIndex(key);
			if (target >= 0) {
				graph.links.push({"source": getIndex(rels[i].node_id),
				"target": target,
				"value": rels[i].relation_ids[key]});
			}
		}
	}

	svg.selectAll(".link").remove();
	svg.selectAll(".node").remove();
	
	force
	  .nodes(graph.nodes)
	  .links(graph.links)
	  .start();
	  
	var link = svg.selectAll(".link")
		.data(graph.links)
		.enter().append("line")
		.attr("class", "link")
		.style("stroke-width", function(d) {
			var v = Math.sqrt(d.value);
			return Math.ceil(v*100)/100;
		});

	var node = svg.selectAll(".node")
	  .data(graph.nodes)
	  .enter().append("g")
	  .attr("class", "node")
	  .call(force.drag);

	node.append("circle")
		.attr("r",  function(d) { return (d.id == id ? 12 : 6); })
		.style("fill", function(d) {
			switch(Number(d.group)) {
				case 1: return '#ff69b4'; break;
				case 2: return '#4169e1'; break;
				case 3: return '#ffd700'; break;
				case 9: return '#00ff00'; break;
			}
		});
	  
	node.append("title")
		.text(function(d) { return d.name; });

	node.append("text")
		.attr("class", "text")
		.text(function(d) { return d.name; });


	force.on("tick", function() {
	link.attr("x1", function(d) { return d.source.x; })
	    .attr("y1", function(d) { return d.source.y; })
	    .attr("x2", function(d) { return d.target.x; })
	    .attr("y2", function(d) { return d.target.y; });

	node.attr("transform", function(d) { return 'translate(' + d.x + ',' + d.y + ')'; });
	// node.attr("cx", function(d) { return d.x; })
	//     .attr("cy", function(d) { return d.y; });
	});
}

$(function () {
	initForceLayout();
	createForceLayout();
	
	$('#search-list').on('change', function() {
		createForceLayout($('#search-list').val(), $('#recursive').val());
	});
	$('#recursive').on('change', function() {
		createForceLayout($('#search-list').val(), $('#recursive').val());
	});
});